Repository: wali1984/Darul-Irfan
Catalog: DarulIrfanApp/Resources/Localizations/Localizable.xcstrings
Source language: en
Languages: ur

source: No bookmarks yet
ur: ابھی کوئی نشانی نہیں

source: No bookmarks yet. Save a moment to return to it later.
ur: ابھی کوئی نشانی نہیں۔ کسی لمحے کو محفوظ کریں تاکہ بعد میں وہیں لوٹ سکیں۔

source: No counters yet
ur: ابھی کوئی کاؤنٹر نہیں

source: No events right now
ur: اس وقت کوئی تقریب نہیں

source: No favorites yet
ur: ابھی کوئی پسندیدہ نہیں

source: No items match these filters
ur: ان فلٹرز سے مطابقت رکھنے والی کوئی چیز نہیں

source: No items yet
ur: ابھی کوئی چیز نہیں

source: No matching places
ur: کوئی مطابق مقام نہیں

source: No matching places found. Try a nearby larger city.
ur: کوئی مطابق مقام نہیں ملا۔ قریبی بڑے شہر کا نام آزمائیں۔

source: No offset
ur: کوئی ایڈجسٹمنٹ نہیں

source: No prayers marked yet
ur: ابھی کوئی نماز نشان زد نہیں

source: No results found
ur: کوئی نتیجہ نہیں ملا

source: No surahs match your search
ur: آپ کی تلاش سے کوئی سورت نہیں ملی

source: No timetable yet
ur: ابھی کوئی نظام الاوقات نہیں

source: No upcoming days found
ur: کوئی آئندہ ایام نہیں ملے

source: None
ur: کوئی نہیں

source: Not determined yet
ur: ابھی معلوم نہیں

source: Not marked
ur: نشان نہیں لگا

source: Not set
ur: مقرر نہیں

source: Not set yet
ur: ابھی مقرر نہیں

source: Notable Islamic days will appear here. Updating the app should restore the bundled list.
ur: اہم اسلامی ایام یہاں ظاہر ہوں گے۔ ایپ کو اپ ڈیٹ کرنے سے فہرست بحال ہو جانی چاہیے۔

source: Notable days of the Hijri year, with approximate dates
ur: ہجری سال کے اہم ایام، تخمینی تاریخوں کے ساتھ

source: Note (optional)
ur: نوٹ (اختیاری)

source: Nothing here yet
ur: یہاں ابھی کچھ نہیں

source: Nothing is playing
ur: کچھ نہیں چل رہا

source: Notification Chime
ur: اطلاعی گھنٹی

source: Notifications
ur: اطلاعات

source: Notifications are allowed
ur: اطلاعات کی اجازت ہے

source: Notifications are local
ur: اطلاعات مقامی ہیں

source: Notifications are off
ur: اطلاعات بند ہیں

source: Notifications are off for now. Prayer times will always be available in the app, and you can enable alerts later in the iPhone Settings app.
ur: اطلاعات فی الحال بند ہیں۔ نماز کے اوقات ایپ میں ہمیشہ دستیاب رہیں گے، اور آپ بعد میں آئی فون کی ترتیبات ایپ سے الرٹس فعال کر سکتے ہیں۔

source: Notifications are turned off
ur: اطلاعات بند کر دی گئی ہیں

source: Now
ur: اب

source: Now Playing
ur: اب چل رہا ہے

source: Now playing: %@
ur: اب چل رہا ہے: %@

source: Now: %@
ur: اب: %@

source: OK
ur: ٹھیک ہے

source: Off
ur: بند

source: Off — enable anytime in Settings
ur: بند — ترتیبات میں کبھی بھی فعال کریں

source: Offline text packs arrive through content updates. Until then, you can read this surah on quran.com.
ur: آف لائن متن مواد کی اپ ڈیٹس کے ذریعے آتا ہے۔ اس وقت تک آپ یہ سورت quran.com پر پڑھ سکتے ہیں۔

source: Offsets shift each calculated time by up to 30 minutes either way. Notifications and widgets update automatically.
ur: ایڈجسٹمنٹ ہر حساب شدہ وقت کو زیادہ سے زیادہ 30 منٹ آگے یا پیچھے کرتی ہے۔ اطلاعات اور ویجٹس خودکار طور پر تازہ ہو جاتے ہیں۔

source: On
ur: فعال

source: On Ayahs %lld–%lld
ur: آیات %lld–%lld پر

source: Online Zikr
ur: آن لائن ذکر

source: Open %@ on YouTube
ur: %@ یوٹیوب پر کھولیں

source: Open %@ on the website
ur: %@ ویب سائٹ پر کھولیں

source: Open Darul Irfan to keep prayer alerts fresh.
ur: نماز کے الرٹس تازہ رکھنے کے لیے دارالعرفان کھولیں۔

source: Open Darul Irfan to set up prayer times
ur: نماز کے اوقات کی ترتیب کے لیے دارالعرفان کھولیں

source: Open PDF
ur: پی ڈی ایف کھولیں

source: Open Settings to Allow Location
ur: مقام کی اجازت کے لیے ترتیبات کھولیں

source: Open Settings to Allow Notifications
ur: اطلاعات کی اجازت کے لیے ترتیبات کھولیں

source: Open iPhone Settings
ur: آئی فون کی ترتیبات کھولیں

source: Open on YouTube
ur: یوٹیوب پر کھولیں

source: Open on website
ur: ویب سائٹ پر کھولیں

source: Open source page
ur: ماخذ صفحہ کھولیں

source: Open-ended
ur: غیر محدود

source: Opens externally in YouTube
ur: یوٹیوب میں کھلتا ہے

source: Opens the full player
ur: مکمل پلیئر کھولتا ہے

source: Out of respect for the publisher's rights, the full text of this item is hosted on the official Naqshbandia Owaisiah website.
ur: ناشر کے حقوق کے احترام میں اس تحریر کا مکمل متن نقشبندیہ اویسیہ کی آفیشل ویب سائٹ پر موجود ہے۔

source: Page
ur: صفحہ

source: Permission
ur: اجازت

source: Permission has not been requested yet
ur: ابھی اجازت طلب نہیں کی گئی

source: Play
ur: چلائیں

source: Play %@
ur: %@ چلائیں

source: Playback position
ur: پلے بیک مقام

source: Playback speed
ur: پلے بیک رفتار

source: Playback speed, currently %@
ur: پلے بیک رفتار، اس وقت %@

source: Please try again in a moment.
ur: براہِ کرم تھوڑی دیر بعد دوبارہ کوشش کریں۔

source: Please try again. If this continues, reinstalling the app can restore the bundled Quran data.
ur: براہِ کرم دوبارہ کوشش کریں۔ اگر مسئلہ برقرار رہے تو ایپ دوبارہ انسٹال کرنے سے قرآن کا ڈیٹا بحال ہو سکتا ہے۔

source: Poetry
ur: کلام

source: Prayed
ur: ادا کی

source: Prayed in congregation (Jamaat)
ur: باجماعت ادا کی (جماعت)

source: Prayer
ur: نماز

source: Prayer Alerts
ur: نماز کے الرٹس

source: Prayer History
ur: نماز کی سرگزشت

source: Prayer Setup
ur: نماز کی ترتیب

source: Prayer Time Calculation
ur: اوقاتِ نماز کا حساب

source: Prayer Tracker
ur: نماز ٹریکر

source: Prayer alerts
ur: نماز کے الرٹس

source: Prayer alerts and the reminders you set are scheduled entirely on your device by iOS. No notification service in the cloud is involved.
ur: نماز کے الرٹس اور آپ کی مقرر کردہ یاد دہانیاں مکمل طور پر آپ کی ڈیوائس پر iOS کے ذریعے طے ہوتی ہیں۔ کلاؤڈ کی کوئی اطلاعاتی سروس شامل نہیں۔

source: Prayer alerts are on. You'll be reminded gently at each prayer time.
ur: نماز کے الرٹس فعال ہیں۔ ہر نماز کے وقت آپ کو نرمی سے یاد دہانی کرائی جائے گی۔

source: Prayer alerts stay silent until notifications are allowed in the Settings app.
ur: جب تک ترتیبات ایپ میں اطلاعات کی اجازت نہ ہو، نماز کے الرٹس خاموش رہتے ہیں۔

source: Prayer reminder
ur: نماز کی یاد دہانی

source: Prayer setup, appearance and storage
ur: نماز کی ترتیبات، ظاہری شکل اور اسٹوریج

source: Prayer times and the Qibla direction are calculated locally. Your coordinates are never sent to a server, and no location history is kept — only the name of the city used for calculations is saved.
ur: نماز کے اوقات اور قبلے کی سمت کا حساب مقامی طور پر ہوتا ہے۔ آپ کے کوآرڈینیٹس کبھی کسی سرور کو نہیں بھیجے جاتے، اور مقام کی کوئی سرگزشت نہیں رکھی جاتی — صرف حساب کے لیے استعمال ہونے والے شہر کا نام محفوظ ہوتا ہے۔

source: Prayer times and the Qibla direction depend on where you are.
ur: نماز کے اوقات اور قبلے کی سمت کا انحصار آپ کے مقام پر ہے۔

source: Prayer times are calculated entirely on this device using the open-source adhan-swift library by Batoul Apps, used under the MIT License.
ur: نماز کے اوقات مکمل طور پر اسی ڈیوائس پر Batoul Apps کی اوپن سورس لائبریری adhan-swift کے ذریعے حساب کیے جاتے ہیں، جو MIT لائسنس کے تحت استعمال ہوتی ہے۔

source: Prayer times are calculated privately on your device once a location is set.
ur: مقام مقرر ہونے پر نماز کے اوقات آپ کی ڈیوائس پر نجی طور پر حساب کیے جاتے ہیں۔

source: Prayer times unavailable
ur: نماز کے اوقات دستیاب نہیں

source: Prayer times will be calculated for
ur: نماز کے اوقات اس مقام کے لیے نکالے جائیں گے

source: Prayers marked
ur: نشان زد نمازیں

source: Pre-Prayer Reminder
ur: نماز سے پہلے یاد دہانی

source: Prefer a specific city? You can choose one anytime from the More tab under Settings.
ur: کسی خاص شہر کو ترجیح دیتے ہیں؟ مزید ٹیب میں ترتیبات سے کبھی بھی منتخب کیا جا سکتا ہے۔

source: Press Release
ur: پریس ریلیز

source: Press Releases
ur: پریس ریلیز

source: Preview Chime
ur: گھنٹی سنیں

source: Previous month
ur: پچھلا مہینہ

source: Privacy
ur: رازداری

source: Program
ur: پروگرام

source: Programs & Events
ur: پروگرام اور تقریبات

source: Programs at Dar-ul-Irfan will appear here when they are announced. You can also check naqshbandiaowaisiah.org.
ur: دارالعرفان کے پروگراموں کا اعلان ہونے پر وہ یہاں ظاہر ہوں گے۔ آپ naqshbandiaowaisiah.org بھی ملاحظہ کر سکتے ہیں۔

source: Publications
ur: مطبوعات

source: Published %@
ur: %@ کو شائع ہوا

source: Punjabi
ur: پنجابی

source: Qatar
ur: قطر

source: Qaza — to make up later, in your own time
ur: قضا — بعد میں اپنی سہولت سے ادا کرنے کے لیے

source: Qibla
ur: قبلہ

source: Qibla Compass
ur: قبلہ نما

source: Qibla compass
ur: قبلہ نما

source: Qibla is %lld° to your left
ur: قبلہ آپ کے بائیں جانب %lld° پر ہے

source: Qibla is %lld° to your right
ur: قبلہ آپ کے دائیں جانب %lld° پر ہے

source: Qibla: %lld° from North
ur: قبلہ: شمال سے %lld°

source: Queue
ur: قطار

source: Qur'an Translation
ur: قرآن کا ترجمہ

source: Quran
ur: قرآن

source: Ramadan
ur: رمضان

source: Ramadan Aitekaaf
ur: رمضان اعتکاف

source: Read on naqshbandiaowaisiah.org
ur: naqshbandiaowaisiah.org پر پڑھیں

source: Read on quran.com
ur: quran.com پر پڑھیں

source: Read the Method of Zikr
ur: طریقۂ ذکر پڑھیں

source: Reader Text Size
ur: مطالعے کے متن کا سائز

source: Reader options
ur: مطالعے کے اختیارات

source: Reading
ur: مطالعہ

source: Recommended
ur: تجویز کردہ

source: Remind Me
ur: مجھے یاد دلائیں

source: Remind Me Before Each Prayer
ur: ہر نماز سے پہلے مجھے یاد دلائیں

source: Remind me before each session
ur: ہر نشست سے پہلے مجھے یاد دلائیں

source: Remove All Downloads
ur: تمام ڈاؤن لوڈز ہٹائیں

source: Remove all downloaded content?
ur: تمام ڈاؤن لوڈ شدہ مواد ہٹائیں؟

source: Remove bookmark from Ayah %lld
ur: آیت %lld سے نشانی ہٹائیں

source: Remove download
ur: ڈاؤن لوڈ ہٹائیں

source: Remove from favorites
ur: پسندیدہ سے ہٹائیں

source: Remove one count
ur: ایک شمار گھٹائیں

source: Removing downloads frees space on this device; everything remains available to stream or download again.
ur: ڈاؤن لوڈز ہٹانے سے اس ڈیوائس پر جگہ خالی ہوتی ہے؛ سب کچھ دوبارہ اسٹریم یا ڈاؤن لوڈ کے لیے دستیاب رہتا ہے۔

source: Reset
ur: صفر کریں

source: Reset All Offsets
ur: تمام ایڈجسٹمنٹ صفر کریں

source: Reset count
ur: شمار صفر کریں

source: Reset this counter?
ur: یہ کاؤنٹر صفر کریں؟

source: Resume %@
ur: %@ دوبارہ جاری کریں

source: Salana Ijtema
ur: سالانہ اجتماع

source: Save
ur: محفوظ کریں

source: Saved %@
ur: %@ کو محفوظ ہوئی

source: Saves a bookmark at %@.
ur: %@ پر نشانی محفوظ کرتا ہے۔

source: Schedule not available
ur: شیڈول دستیاب نہیں

source: Schedule source: naqshbandiaowaisiah.org
ur: شیڈول کا ماخذ: naqshbandiaowaisiah.org

source: Search
ur: تلاش

source: Search Darul Irfan
ur: دارالعرفان میں تلاش کریں

source: Search by name or number
ur: نام یا نمبر سے تلاش کریں

source: Search for a city
ur: شہر تلاش کریں

source: Search is unavailable right now
ur: تلاش اس وقت دستیاب نہیں

source: Searching…
ur: تلاش جاری ہے…

source: Selected City
ur: منتخب شہر

source: Send an email
ur: ای میل بھیجیں

source: Set a location on the Prayer tab and the monthly timetable will appear here.
ur: نماز ٹیب پر مقام مقرر کریں، ماہانہ نظام الاوقات یہاں ظاہر ہو جائے گا۔

source: Set your location to find the Qibla
ur: قبلہ معلوم کرنے کے لیے اپنا مقام مقرر کریں

source: Settings
ur: ترتیبات

source: Seventh of the Night
ur: رات کا ساتواں حصہ

source: Shafi (standard)
ur: شافعی (معیاری)

source: Share file
ur: فائل شیئر کریں

source: Share reference to Ayah %lld
ur: آیت %lld کا حوالہ شیئر کریں

source: Share source link
ur: ماخذ کا لنک شیئر کریں

source: Share this month's timetable
ur: اس مہینے کا نظام الاوقات شیئر کریں

source: Sheikh-e-Silsila Naqshbandia Owaisiah (MZA)
ur: شیخِ سلسلہ نقشبندیہ اویسیہ (مدظلہ العالی)

source: Short Clips
ur: مختصر کلپس

source: Show tafsir
ur: تفسیر دکھائیں

source: Show translation
ur: ترجمہ دکھائیں

source: Shows the name enlarged
ur: نام بڑا کر کے دکھاتا ہے

source: Silent
ur: خاموش

source: Silent shows a banner without sound. Azan Clip plays a short chime with the alert.
ur: خاموش بغیر آواز کے بینر دکھاتا ہے۔ اذان کلپ الرٹ کے ساتھ ایک مختصر گھنٹی چلاتا ہے۔

source: Silsila Naqshbandia Owaisiah
ur: سلسلہ نقشبندیہ اویسیہ

source: Singapore
ur: سنگاپور

source: Skip
ur: چھوڑیں

source: Small
ur: چھوٹا

source: Some files could not be removed. Please try again.
ur: کچھ فائلیں نہیں ہٹ سکیں۔ براہِ کرم دوبارہ کوشش کریں۔

source: Something went wrong
ur: کچھ خرابی پیش آئی

source: Something went wrong while loading. Please go back and try again.
ur: لوڈ کرتے وقت کچھ خرابی پیش آئی۔ براہِ کرم واپس جا کر دوبارہ کوشش کریں۔

source: Something went wrong while preparing the app. Your data is safe — please try again.
ur: ایپ کی تیاری کے دوران کچھ خرابی پیش آئی۔ آپ کا ڈیٹا محفوظ ہے — براہِ کرم دوبارہ کوشش کریں۔

source: Sound
ur: آواز

source: Source & Contact
ur: ماخذ اور رابطہ

source: Standard
ur: معیاری

source: Step %lld of %lld
ur: %2$lld میں سے مرحلہ %1$lld

source: Stop playback
ur: پلے بیک روکیں

source: Storage
ur: اسٹوریج

source: Storage Used
ur: استعمال شدہ اسٹوریج

source: Storage details could not be loaded right now.
ur: اسٹوریج کی تفصیلات اس وقت لوڈ نہیں ہو سکیں۔

source: Stream Unavailable
ur: نشریات دستیاب نہیں

source: Sufi Poetry
ur: صوفیانہ کلام

source: Suhoor ends %@
ur: سحری کا اختتام %@

source: Suhoor ends in
ur: سحری ختم ہونے میں

source: Suhoor ends: %@
ur: سحری کا اختتام: %@

source: Sunrise
ur: طلوعِ آفتاب

source: Sunrise in %lld minutes
ur: طلوعِ آفتاب %lld منٹ میں

source: Sunrise time
ur: طلوعِ آفتاب کا وقت

source: Supplications from the Quran, with sources
ur: قرآنِ کریم سے ماخوذ دعائیں، حوالوں کے ساتھ

source: Surah %@, Ayah %lld — Quran %lld:%lld
ur: سورہ %@، آیت %lld — قرآن %lld:%lld

source: System
ur: سسٹم

source: System follows your device's light or dark appearance.
ur: سسٹم آپ کی ڈیوائس کی روشن یا تاریک شکل کے مطابق چلتا ہے۔

source: Tafseer-e-Quran
ur: تفسیرِ قرآن

source: Tafsir
ur: تفسیر

source: Tafsir on the website
ur: ویب سائٹ پر تفسیر

source: Tap anywhere to count
ur: شمار کے لیے کہیں بھی تھپتھپائیں

source: Tap the circles on the Prayer tab to record each prayer — gently, at your own pace.
ur: ہر نماز درج کرنے کے لیے نماز ٹیب پر دائروں کو چھوئیں — نرمی سے، اپنی رفتار کے ساتھ۔

source: Tap the star on any library item to keep it here for quick access.
ur: کسی بھی چیز پر ستارے کو چھوئیں تاکہ وہ فوری رسائی کے لیے یہاں محفوظ رہے۔

source: Target
ur: ہدف

source: Target (optional)
ur: ہدف (اختیاری)

source: Target reached — Alhamdulillah
ur: ہدف مکمل — الحمد للہ

source: Target: %lld
ur: ہدف: %lld

source: Tasbih
ur: تسبیح

source: Tasbih Counter
ur: تسبیح کاؤنٹر

source: Tasbih Counters
ur: تسبیح کاؤنٹرز

source: Tazkiyah-e-Nafs
ur: تزکیۂ نفس

source: Teachings
ur: تعلیمات

source: Tehran
ur: تہران

source: Text Size
ur: متن کا سائز

source: That's completely fine — you can choose your city below instead, or allow access in the iPhone Settings app.
ur: کوئی بات نہیں — آپ نیچے اپنا شہر منتخب کر سکتے ہیں، یا آئی فون کی ترتیبات ایپ میں رسائی کی اجازت دے سکتے ہیں۔

source: The 99 Names of Allah could not be loaded. Updating or reinstalling the app should restore them.
ur: اللہ کے 99 نام لوڈ نہیں ہو سکے۔ ایپ کو اپ ڈیٹ یا دوبارہ انسٹال کرنے سے یہ بحال ہو جانے چاہئیں۔

source: The AlMurshid TV live stream could not be reached. It may be off air right now — please try again later.
ur: المرشد ٹی وی کی براہِ راست نشریات تک رسائی نہیں ہو سکی۔ ممکن ہے نشریات اس وقت بند ہوں — براہِ کرم بعد میں کوشش کریں۔

source: The English translation of the Qur'an included in this app is by Muhammad Marmaduke Pickthall (The Meaning of the Glorious Koran, 1930), which is in the public domain.
ur: اس ایپ میں شامل قرآنِ کریم کا انگریزی ترجمہ محمد مارماڈیوک پکتھال (The Meaning of the Glorious Koran، 1930) کا ہے، جو پبلک ڈومین میں ہے۔

source: The archive could not be loaded right now. Please try again in a moment.
ur: آرکائیو اس وقت لوڈ نہیں ہو سکا۔ براہِ کرم تھوڑی دیر بعد دوبارہ کوشش کریں۔

source: The bookmark could not be removed. Please try again.
ur: نشانی نہیں ہٹ سکی۔ براہِ کرم دوبارہ کوشش کریں۔

source: The bookmark could not be saved. Please try again.
ur: نشانی محفوظ نہیں ہو سکی۔ براہِ کرم دوبارہ کوشش کریں۔

source: The chime preview could not be played right now.
ur: گھنٹی کا نمونہ اس وقت نہیں چل سکا۔

source: The complete illustrated method of zikr is taught on the official website.
ur: ذکر کا مکمل مصور طریقہ آفیشل ویب سائٹ پر سکھایا جاتا ہے۔

source: The download could not be completed. Please check your connection and try again.
ur: ڈاؤن لوڈ مکمل نہیں ہو سکا۔ براہِ کرم اپنا کنکشن چیک کر کے دوبارہ کوشش کریں۔

source: The download didn't finish. Please try again.
ur: ڈاؤن لوڈ مکمل نہیں ہوا۔ براہِ کرم دوبارہ کوشش کریں۔

source: The duas could not be loaded. Updating or reinstalling the app should restore them.
ur: دعائیں لوڈ نہیں ہو سکیں۔ ایپ کو اپ ڈیٹ یا دوبارہ انسٹال کرنے سے یہ بحال ہو جانی چاہئیں۔

source: The event could not be added to your calendar. Please try again.
ur: تقریب آپ کے کیلنڈر میں شامل نہیں ہو سکی۔ براہِ کرم دوبارہ کوشش کریں۔

source: The file may be damaged or not a PDF. Try removing the download and downloading it again.
ur: ممکن ہے فائل خراب ہو یا پی ڈی ایف نہ ہو۔ ڈاؤن لوڈ ہٹا کر دوبارہ ڈاؤن لوڈ کر کے دیکھیں۔

source: The high-latitude rule adjusts Fajr and Isha in places where twilight lasts unusually long. Automatic follows the recommended rule for your location.
ur: بلند عرض بلد کا اصول ان مقامات پر فجر اور عشاء کو درست کرتا ہے جہاں شفق غیر معمولی دیر تک رہتی ہے۔ خودکار آپ کے مقام کے لیے تجویز کردہ اصول اپناتا ہے۔

source: The lecture archive, organized by year and month
ur: خطابات کا آرکائیو، سال اور مہینے کے اعتبار سے مرتب

source: The library is being prepared
ur: کتب خانہ تیار کیا جا رہا ہے

source: The media library could not be loaded right now. Please try again in a moment.
ur: میڈیا لائبریری اس وقت لوڈ نہیں ہو سکی۔ براہِ کرم تھوڑی دیر بعد دوبارہ کوشش کریں۔

source: The media library is being prepared
ur: میڈیا لائبریری تیار کی جا رہی ہے

source: The method of zikr in the Naqshbandia Owaisiah order is Zikr-e Khafi Qalbi, practised with Pas Anfas — "guarding every breath".
ur: سلسلہ نقشبندیہ اویسیہ میں ذکر کا طریقہ ذکرِ خفی قلبی ہے، جو پاسِ انفاس — یعنی "ہر سانس کی نگہبانی" — کے ساتھ کیا جاتا ہے۔

source: The online zikr schedule could not be loaded. Current timings are always announced on naqshbandiaowaisiah.org.
ur: آن لائن ذکر کا شیڈول لوڈ نہیں ہو سکا۔ موجودہ اوقات کا اعلان ہمیشہ naqshbandiaowaisiah.org پر کیا جاتا ہے۔

source: The online zikr session begins soon. The Paltalk room opens while the session is in progress.
ur: آن لائن ذکر کی نشست جلد شروع ہو رہی ہے۔ Paltalk روم نشست کے دوران کھلتا ہے۔

source: The order was revived in the last century by Shaikh Allah Yar Khan (1904–1984) and afterwards led by Hazrat Ameer Muhammad Akram Awan (RA). It is presently led by Sheikh-e-Silsila Hazrat Ameer Abdul Qadeer Awan (MZA), born 26 March 1973 in Munara, District Chakwal.
ur: گزشتہ صدی میں اس سلسلے کا احیاء شیخ اللہ یار خان (1904–1984) کے ہاتھوں ہوا، جس کے بعد حضرت امیر محمد اکرم اعوان (رحمۃ اللہ علیہ) نے قیادت فرمائی۔ اس وقت شیخِ سلسلہ حضرت امیر عبد القدیر اعوان (مدظلہ العالی) قیادت فرما رہے ہیں، جن کی ولادت 26 مارچ 1973 کو منارہ، ضلع چکوال میں ہوئی۔

source: The search could not be completed. Please check your connection and try again.
ur: تلاش مکمل نہیں ہو سکی۔ براہِ کرم اپنا کنکشن چیک کر کے دوبارہ کوشش کریں۔

source: The search didn't go through. Please check your connection and try again.
ur: تلاش مکمل نہیں ہو سکی۔ براہِ کرم اپنا کنکشن چیک کر کے دوبارہ کوشش کریں۔

source: The short prayer chime used for alerts is an original recording created for this app.
ur: الرٹس کے لیے استعمال ہونے والی مختصر گھنٹی اسی ایپ کے لیے تیار کردہ اصل ریکارڈنگ ہے۔

source: The sun is rising.
ur: سورج طلوع ہو رہا ہے۔

source: The surah list could not be loaded
ur: سورتوں کی فہرست لوڈ نہیں ہو سکی

source: The upcoming prayer with a live countdown.
ur: آنے والی نماز، براہِ راست الٹی گنتی کے ساتھ۔

source: Theme
ur: تھیم

source: These defaults suit most people. You can fine-tune angles and minute offsets later in Settings.
ur: یہ طے شدہ ترتیبات اکثر لوگوں کے لیے موزوں ہیں۔ زاویے اور منٹ کی ایڈجسٹمنٹ بعد میں ترتیبات میں کی جا سکتی ہے۔

source: These items could not be loaded right now. Please try again in a moment.
ur: یہ چیزیں اس وقت لوڈ نہیں ہو سکیں۔ براہِ کرم تھوڑی دیر بعد دوبارہ کوشش کریں۔

source: This device doesn't provide live compass headings. Use the bearing below with any physical compass.
ur: یہ ڈیوائس براہِ راست قطب نما رخ فراہم نہیں کرتی۔ نیچے دیا گیا زاویہ کسی بھی عام قطب نما کے ساتھ استعمال کریں۔

source: This item is unavailable
ur: یہ چیز دستیاب نہیں

source: This surah could not be opened
ur: یہ سورت نہیں کھل سکی

source: This surah's text is not on your device yet
ur: اس سورت کا متن ابھی آپ کی ڈیوائس پر نہیں

source: This year could not be loaded right now. Please try again in a moment.
ur: یہ سال اس وقت لوڈ نہیں ہو سکا۔ براہِ کرم تھوڑی دیر بعد دوبارہ کوشش کریں۔

source: Times could not be calculated for this location today. A different high-latitude rule in Settings may help.
ur: آج اس مقام کے لیے اوقات کا حساب نہیں ہو سکا۔ ترتیبات میں بلند عرض بلد کا کوئی دوسرا اصول مددگار ہو سکتا ہے۔

source: Title
ur: عنوان

source: To receive event reminders, please allow notifications for Darul Irfan in iOS Settings.
ur: تقریبات کی یاد دہانیاں پانے کے لیے براہِ کرم iOS کی ترتیبات میں دارالعرفان کے لیے اطلاعات کی اجازت دیں۔

source: To receive zikr reminders, please allow notifications for Darul Irfan in iOS Settings.
ur: ذکر کی یاد دہانیاں پانے کے لیے براہِ کرم iOS کی ترتیبات میں دارالعرفان کے لیے اطلاعات کی اجازت دیں۔

source: Today
ur: آج

source: Today's Prayer Times
ur: آج کے نماز کے اوقات

source: Today's Times
ur: آج کے اوقات

source: Today's prayers are complete
ur: آج کی نمازیں مکمل ہو گئیں

source: Today's times are complete. Tomorrow's schedule will appear after midnight.
ur: آج کے اوقات مکمل ہو گئے۔ کل کا نظام الاوقات نصف شب کے بعد ظاہر ہوگا۔

source: Training Courses
ur: تربیتی کورس

source: Try Again
ur: دوبارہ کوشش کریں

source: Try a different word or a shorter phrase.
ur: کوئی دوسرا لفظ یا مختصر جملہ آزمائیں۔

source: Try a different word, or switch to All to search every section.
ur: کوئی دوسرا لفظ آزمائیں، یا ہر حصے میں تلاش کے لیے «سب» منتخب کریں۔

source: Try a surah name, its English meaning, or a number from 1 to 114.
ur: سورت کا نام، اس کا انگریزی مفہوم، یا 1 سے 114 تک کوئی نمبر آزمائیں۔

source: Try choosing a different language or type.
ur: کوئی دوسری زبان یا قسم منتخب کر کے دیکھیں۔

source: Try downloading again
ur: دوبارہ ڈاؤن لوڈ کرنے کی کوشش کریں

source: Try searching with the city name in English, for example "Chakwal".
ur: شہر کا نام انگریزی میں لکھ کر تلاش کریں، مثلاً "Chakwal"۔

source: Turkey (Diyanet)
ur: ترکی (دیانت)

source: Twilight Angle
ur: شفق کا زاویہ

source: Type
ur: قسم

source: Umm al-Qura (Makkah)
ur: امّ القریٰ (مکہ مکرمہ)

source: Unable to open this file
ur: یہ فائل نہیں کھل سکی

source: University of Islamic Sciences, Karachi
ur: جامعہ علومِ اسلامیہ، کراچی

source: Upcoming program at %@.
ur: %@ میں آئندہ پروگرام۔

source: Update Now
ur: ابھی اپ ڈیٹ کریں

source: Urdu
ur: اردو

source: Urdu applies a right-to-left layout across the app.
ur: اردو منتخب کرنے پر پوری ایپ دائیں سے بائیں ترتیب اختیار کرتی ہے۔

source: Use English throughout the app
ur: پوری ایپ میں انگریزی استعمال کریں

source: Use My Current Location
ur: میرا موجودہ مقام استعمال کریں

source: Use My Location
ur: میرا مقام استعمال کریں

source: Use Urdu throughout the app
ur: پوری ایپ میں اردو استعمال کریں

source: Version %@
ur: ورژن %@

source: Video Lectures
ur: ویڈیو خطابات

source: View on naqshbandiaowaisiah.org
ur: naqshbandiaowaisiah.org پر دیکھیں

source: View on website
ur: ویب سائٹ پر دیکھیں

source: View prayer history
ur: نمازوں کی سرگزشت دیکھیں

source: View source
ur: ماخذ دیکھیں

source: View source on naqshbandiaowaisiah.org
ur: naqshbandiaowaisiah.org پر ماخذ دیکھیں

source: View source on the Naqshbandia Owaisiah website
ur: نقشبندیہ اویسیہ کی ویب سائٹ پر ماخذ دیکھیں

source: View the adhan-swift project on GitHub
ur: GitHub پر adhan-swift پروجیکٹ دیکھیں

source: Visit the source website
ur: ماخذ ویب سائٹ ملاحظہ کریں
